{
  "header_menu": {
    "education": "Educaci칩n",
    "projects": "Proyectos"
  },

  "hero_section": {
    "info": "Abierto a nuevas oportunidades",
    "firstname": "Gabriele Prestano",
    "role": "Desarrollador de Front End Junior",
    "description": "Desarrollador de Front-End Junior autodidacta, apasionado por el desarrollo web y el dise침o moderno. Trabajo principalmente con <strong>React</strong>, <strong>Next.js</strong>, <strong>TypeScript</strong>, <strong>TailwindCSS</strong> y <strong>Zustand/Redux</strong> para la gesti칩n del estado. Soy curioso y determinado, siempre en busca de nuevos desaf칤os para crecer como desarrollador y crear interfaces limpias y funcionales.",
    "contact-me-button": "Cont치ctame"
  },

  "tecnologies_section": {
    "title": "Tecnolog칤as que uso"
  },

  "education_section": {
    "title": "Educaci칩n y Formaci칩n"
  },

  "education_cards": {
    "school": {
      "name": "Istituto Superiore Majorana",
      "subtitle": "Diploma en Inform치tica",
      "topics": [
        "Estudio del lenguaje de programaci칩n Java;",
        "Estudio y desarrollo de un proyecto de clase con base de datos MySQL;",
        "Estudio y creaci칩n de un proyecto escolar con Joomla."
      ]
    },
    "udemy": {
      "name": "Udemy",
      "subtitle": "JavaScript - La gu칤a completa",
      "topics": [
        "Profundizaci칩n en JavaScript;",
        "Breve introducci칩n a Node.js y Express;",
        "Introducci칩n a TypeScript y React;",
        "Breve introducci칩n a Angular;",
        "Introducci칩n al gestor de paquetes npm."
      ]
    }
  },

  "projects_section": {
    "title": "Mis Proyectos",
    "categories": {
      "all": "Todos"
    },
    "list": {
      "angularPantoEcommerce": {
        "description": "Panto es un frontend moderno y responsive para un e-commerce de muebles, construido con Angular 20, TypeScript, Tailwind CSS, NgRx y PrimeNG. Permite a los usuarios navegar, buscar y filtrar un amplio cat치logo de muebles, as칤 como guardar art칤culos en la lista de deseos o carrito."
      },
      "mernReadlyApp": {
        "description": "Readly es una app web MERN que permite a los usuarios explorar, buscar y filtrar cientos de libros, mientras que los administradores pueden a침adir, actualizar y eliminar libros f치cilmente."
      },
      "nextjsGameshelf": {
        "description": "Una biblioteca de juegos desarrollada con Next.js, TypeScript, TailwindCSS y Redux Toolkit. Los usuarios pueden explorar una amplia variedad de juegos, buscarlos, filtrarlos, ver p치ginas detalladas y gestionar su lista de favoritos."
      },
      "reactRecipesApp": {
        "description": "Una app de recetas moderna y responsiva, desarrollada con React, TypeScript, TailwindCSS, Zustand y React Router. Los usuarios pueden explorar, buscar y filtrar recetas, ver p치ginas detalladas y gestionar su lista de favoritos."
      },
      "angularBrowserExtension": {
        "description": "Gestor de extensiones de navegador, desarrollado con Angular 20. 游꿢 Proyecto personal creado inicialmente en React y recreado en Angular para probar signals, input()/output() y localStorage()."
      },
      "angularQuizApp": {
        "description": "Una app de quiz simple e interactiva, desarrollada con Angular 20 y Sass (SCSS). Permite a los usuarios responder una serie de preguntas, seguir su progreso y ver el puntaje en tiempo real."
      },
      "angularTodoList": {
        "description": "Una lista de tareas simple y moderna creada con Angular para practicar los fundamentos del framework. Los usuarios pueden a침adir, completar, eliminar y filtrar tareas."
      },
      "nextjsExclusive": {
        "description": "Exclusive es un proyecto de e-commerce moderno y minimalista desarrollado con Next.js (React), TypeScript, TailwindCSS y Zustand para la gesti칩n del estado global. Este proyecto me ayud칩 a entender mejor Zustand, progresar en Next.js y mejorar mis habilidades en TypeScript y TailwindCSS."
      },
      "nextjsCineRadar": {
        "description": "CineRadar es una biblioteca de pel칤culas y series desarrollada con Next.js 15. Permite a los usuarios explorar miles de t칤tulos, ver detalles completos y guardar favoritos localmente. Es mi primer proyecto con NextJS y tambi칠n me introdujo a Zustand."
      },
      "reactDragonBall": {
        "description": "Como primer proyecto para probar React Router, desarroll칠 una web app simple dedicada a los personajes del famoso anime Dragon Ball, un dibujo que me encantaba de ni침o."
      },
      "reactQuizApp": {
        "description": "Una app de Quiz desarrollada con React, TypeScript y TailwindCSS v4, con un total de 10 preguntas y 4 opciones disponibles para cada pregunta."
      },
      "reactOldPortfolio": {
        "description": "Como segundo proyecto en React, cre칠 un portfolio personal, lo que me permiti칩 mejorar mis habilidades b치sicas en React y aprender los fundamentos de Framer Motion para crear animaciones simples."
      },
      "reactWeatherApp": {
        "description": "Una app meteorol칩gica simple creada con React, TypeScript y Tailwind CSS v4. Las APIs son proporcionadas por OpenWeatherMap."
      },
      "reactTodoList": {
        "description": "Una moderna lista de tareas creada con React, Vite, TypeScript y TailwindCSS v4, que permite a침adir nuevas tareas, eliminar tareas y guardarlas usando localStorage."
      },
      "reactEducity": {
        "description": "Educity es una r칠plica de un sitio educativo desarrollada con React y Vite como mi primer proyecto, lo que me permiti칩 practicar los conceptos b치sicos de React, explorar los hooks principales (useState, useEffect y useRef) y otras funcionalidades."
      },
      "htmlVehiclesForm": {
        "description": "Un formulario creado con HTML, CSS y TypeScript en el que los usuarios pueden a침adir veh칤culos completando distintos campos de entrada."
      },
      "htmlRockPaperScissors": {
        "description": "Un sencillo emulador del cl치sico juego 'Piedra, Papel o Tijeras', creado con HTML, CSS y JavaScript. El jugador compite contra la CPU eligiendo piedra, papel o tijeras, con puntuaci칩n actualizada en tiempo real. El juego termina al alcanzar 5 puntos."
      },
      "htmlMusicPlayer": {
        "description": "Un sencillo reproductor de m칰sica en el que los usuarios pueden reproducir y detener canciones, hacer clic en 'Me gusta' y usar otros controles."
      }
    }
  },

  "contact": {
    "title": "Cont치ctame",
    "form": {
      "name-placeholder": "Nombre de la empresa",
      "email-placeholder": "empresa@email.com",
      "message-placeholder": "Tu mensaje",
      "isSubmitting:": "Enviando mensaje...",
      "submit": "Enviar mensaje"
    }
  }
}
